# -*- coding: utf-8 -*-
from urlparse import urlparse

KKDD = {
    '1000037': ('441322101', u'G324国道博罗县罗阳镇大小塘路段'),
    '1000053': ('441322102', u'S244省道博罗县湖镇响水路段'),
    '1000039': ('441322103', u'S244省道博罗县湖镇显岗桥路段'),
    '1000067': ('441322104', u'G324国道博罗县龙华镇沙河桥路段'),
    '1000065': ('441322105', u'惠州市博罗县罗阳镇飞龙大道广惠高速出口'),
    '1000070': ('441322106', u'G324国道博罗县罗阳镇汤泉路段'),
    '1000042': ('441322107', u'S244省道博罗县柏塘镇石湖路段'),
    '1000043': ('441322108', u'G205国道博罗县杨侨镇政府路段'),
    '1000066': ('441322109', u'G324国道博罗县长宁镇罗村路段'),
    '1000012': ('441322110', u'S244省道博罗县公庄镇布格桥路段'),
    '1000069': ('441322111', u'惠州市博罗县园洲镇和安大道和安桥路段'),
    '1000046': ('441322112', u'S340省道博罗县石坝镇东江大桥路段'),
    '1000068': ('441322113', u'X223县道博罗县横河镇上河村路段'),
    '1000048': ('441322114', u'X215县道观杨路东江桥路段'),
    '1000072': ('441322115', u'X216县道博罗县园洲镇马嘶桥路段'),
    '1000071': ('441322116', u'惠州市博罗县石湾镇兴业大道沙河桥路段')
}

def hpzl2hpys(hpzl):
    if hpzl == 1:
        return (2, 'BU', u'蓝牌')
    if hpzl in set([2, 10]):
        return (1, 'YL', u'黄牌')
    if hpzl in set([3,4,5,6]):
        return (3, 'BK', u'黑牌')
    if hpzl in set([12,13]):
        return (0, 'WT', u'白牌')
    return (9, 'QT', u'其他')

def fxbh2code(fxbh):
    if fxbh in set([0,4]):
        return ('EW', u'由东往西')
    if fxbh in set([1,5]):
        return ('WE', u'由西往东')
    if fxbh in set([2,6]):
        return ('SN', u'由南往北')
    if fxbh in set([3,7]):
        return ('NS', u'由北往南')
    return ('QT', u'其他')

def build_kkdd_by_url(url_str):
    url = urlparse(url_str)
    return KKDD.get(url.path.split('/')[2][:7], '441322110')


if __name__ == '__main__':
    print hpzl2hpys(12)
    url_str = u'http://10.44.245.247:8081/d/1000043$1$0$3/20160521/15/4003-2717404-0.jpg?streamID:25372@capTime:1463816067'
    print create_kkddid(url_str)
